<?php

namespace console\controllers;

use console\components\TreeBuilder;
use yii\console\Controller;
use yii\helpers\Console;

class TreeController extends Controller
{
    public function actionTest()
    {
        $testArray = [
            ['1.3.2', 'грунт, грунт замусоренный (техн.)', '223.1 ₽'],
            ['1.2.1', 'до 10 км', '344.1 ₽'],
            ['1', 'Земляные работы', '43 ₽'],
            ['2.1.2', 'песок', '123 ₽'],
            ['1.2.4', 'до 40 км', '1045 ₽'],
            ['2.1.8', 'щебень фр.5-20', '6783 ₽'],
            ['2.1.5', 'основание из щебня', '1345 ₽'],
            ['1.2.2', 'до 20 км', '567.43 ₽'],
            ['1.3.1', 'грунт, грунт замусоренный (экологич.чистый)', '654.4 ₽'],
            ['2.1.4', 'ПГС', '735 ₽'],
            ['2.1.7', 'щебень фр.20-40', '4112 ₽'],
            ['2', 'Устройство основания ("пирога")', '534.5 ₽'],
            ['1.2.3', 'до 30 км', '979 ₽'],
            ['2.1.6', 'щебень фр.40-70', '983 ₽'],
            ['1.2', 'Вывоз грунта', '3554 ₽'],
            ['1.4', 'Засыпка', '7648.56 ₽'],
            ['2.1.3', 'основание из ПГС', '7895 ₽'],
            ['2.2', 'Устройство бетонной подготовки', '113 ₽'],
            ['1.2.5', 'до 50 км', '1287 ₽'],
            ['2.1.1', 'основание из песка', '673 ₽'],
            ['1.1', 'Разработка грунта комплексная (с учетом погрузки в автомобили-самосвалы, доработки вручную, планировки и т.п.), вывоз до 1 км', '4123 ₽'],
            ['1.3', 'Утилизация грунта', '1000 ₽'],
            ['2.1', 'Устройство основания', '1123 ₽']
        ];

        $treeBuilder = new TreeBuilder();
        $result = $treeBuilder->loadTreeFromArray($testArray)->saveTreeToDB();

        if ($result) {
            $this->stdout('success'. "\r\n", Console::FG_GREEN);
        } else {
            $this->stdout('error, more info: '.$treeBuilder->lastError. "\r\n", Console::FG_RED);
        }
    }
}

